In [1]:
import xml.etree.ElementTree as ET
from PIL import Image, ImageDraw

# Your XML code
xml_code = '''
<shape>
    <circle>
        <center x="50" y="50"/>
        <radius value="30"/>
    </circle>
</shape>
'''

# Parse the XML
root = ET.fromstring(xml_code)
circle = root.find('circle')
center = circle.find('center')
radius = circle.find('radius')

# Extract data
center_x = int(center.attrib['x'])
center_y = int(center.attrib['y'])
circle_radius = int(radius.attrib['value'])

# Create an image
image_size = (100, 100)  # You can adjust the size as needed
background_color = (255, 255, 255)
circle_color = (0, 0, 0)

image = Image.new("RGB", image_size, background_color)
draw = ImageDraw.Draw(image)

# Draw the circle
circle_center = (center_x, center_y)
draw.ellipse(
    (circle_center[0] - circle_radius, circle_center[1] - circle_radius,
     circle_center[0] + circle_radius, circle_center[1] + circle_radius),
    outline=circle_color
)

# Save the image
image.save("xml_to_image.png")

In [1]:
import pandas as pd

data = pd.DataFrame({
    'Name': ['John', 'Alice'],
    'Math': [90, 85],
    'Science': [88, 92]
})

melted_data = pd.melt(data, id_vars=['Name'], var_name='Subject', value_name='Score')

In [2]:
data

    Name  Math  Science
0   John    90       88
1  Alice    85       92

In [3]:
melted_data

    Name  Subject  Score
0   John     Math     90
1  Alice     Math     85
2   John  Science     88
3  Alice  Science     92

In [4]:
import pandas as pd

data = pd.DataFrame({
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
    'Region': ['North', 'South', 'North', 'South', 'North']
})

cross_tab = pd.crosstab(data['Gender'], data['Region'])

In [5]:
data

   Gender Region
0    Male  North
1  Female  South
2    Male  North
3  Female  South
4    Male  North

In [6]:
cross_tab

Region  North  South
Gender
Female      0      2
Male        3      0

In [7]:
import pandas as pd

data = pd.DataFrame({
    'A': [1, 2],
    'B': [3, 4]
})

stacked_data = data.stack()

In [8]:
data

   A  B
0  1  3
1  2  4

In [9]:
stacked_data

0  A    1
   B    3
1  A    2
   B    4
dtype: int64